# IT salaries project

### This is a project which is a test case for my data science jurney.
<b> Created by Dezs≈ë Szabolcs </b>

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

### Importing the packages from my Python library

In [3]:
import numpy as np
import pandas as pd
import matplotlib as plt

### Reading the external CSV file and document it

In [12]:
salaries_df = pd.read_csv("data/ds_salaries.csv")

**Replacing the dataset index**

In [28]:
salaries_df.index.names = ['ID']

In [32]:
salaries_df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
ID,,,,,,,,,,,
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

**Attributes of the dataset:**
- ID
- Work Year
- Experience level
- Employment Type
- Job Title
- Salary
- Salary Currency
- Salary in USD
- Employee Residence
- Remote Ratio
- Company Location
- Company Size

In [39]:
pd.isna(salaries_df).sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64